In [7]:
import pandas as pd
import numpy as np

In [8]:
Employee={'number':[1,2,3,4,5], 'name':['Vinay','Garg','Tanmay','Sharma','Paras'], 'hourly Salary':[15,12,13,6,12]}

In [14]:
pd.DataFrame(Employee).head(3)

   number    name  hourly Salary
0       1   Vinay             15
1       2    Garg             12
2       3  Tanmay             13

In [15]:
pd.DataFrame(Employee).tail(1)

   number   name  hourly Salary
4       5  Paras             12

In [17]:
pd.DataFrame(Employee).tail(2)

   number    name  hourly Salary
3       4  Sharma              6
4       5   Paras             12

In [23]:
food1= {'number':[1,2,3,4,5],'name':['sitafal','banana','chips','popcorn','pizza'],'price':[2,1,0.5,1,5]}
food2= {'number':[1,2,3,4,5],'name':['apple','banana','chips','popcorn','pizza'],'price':[2,1,0.5,1,5]}

In [24]:
table1= pd.DataFrame(food1)
table2= pd.DataFrame(food2)

In [33]:
fusion = pd.merge(table1,table2,on='number')

In [34]:
fusion

   number   name_x  price_x   name_y  price_y
0       1  sitafal      2.0    apple      2.0
1       2   banana      1.0   banana      1.0
2       3    chips      0.5    chips      0.5
3       4  popcorn      1.0  popcorn      1.0
4       5    pizza      5.0    pizza      5.0